MichaelOwen2022/iMXRT5xx-Loader/SDK_2_12_0_EVK-MIMXRT595/boards/evkmimxrt595/driver_examples/powerquad/benchmark_vector/powerquad_benchmark_vector.c
/*
 * @brief Main function
 */
int main(void)
{
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();

    /* Power up PQ RAM. */
    POWER_DisablePD(kPDRUNCFG_PPD_PQ_SRAM);
    /* Apply power setting. */
    POWER_ApplyPD();

    PRINTF("\r\nCMSIS DSP benchmark vector test start.\r\n");

    PQ_Init(POWERQUAD);

    TEST_InitTime();

    // Powerquad Benchmark Vector Test
    PQ_VectorLnF32Test();
    PQ_VectorLnQ31Test();
    PQ_VectorInvF32Test();
    PQ_VectorInvQ31Test();
    PQ_VectorSqrtF32Test();
    PQ_VectorSqrtQ31Test();
    PQ_VectorInvSqrtF32Test();
    PQ_VectorInvSqrtQ31Test();
    PQ_VectorEtoxF32Test();
    PQ_VectorEtoxQ31Test();
    PQ_VectorEtonxF32Test();
    PQ_VectorEtonxQ31Test();
    PQ_BiquadCascadedf2F32Test();
    PQ_BiquadCascadedf2Q31Test();

    PQ_VectorLnFPTest();
    PQ_VectorLnFXTest();
    PQ_VectorInvFPTest();
    PQ_VectorInvFXTest();
    PQ_VectorSqrtFPTest();
    PQ_VectorSqrtFXTest();
    PQ_VectorInvSqrtFPTest();
    PQ_VectorInvSqrtFXTest();
    PQ_VectorEtoxFPTest();
    PQ_VectorEtoxFXTest();
    PQ_VectorEtonxFPTest();
    PQ_VectorEtonxFXTest();
    PQ_16ByteBiquadCascadedf2FPTest();
    PQ_16ByteBiquadCascadedf2FXTest();

    /* Vector. */
    PQ_VectorSqrtQ31Test();
    PQ_VectorSqrtQ15Test();
    PQ_VectorSinF32Test();
    PQ_VectorSinQ31Test();
    PQ_VectorSinQ15Test();
    PQ_VectorCosF32Test();
    PQ_VectorCosQ31Test();
    PQ_VectorCosQ15Test();

    PRINTF("\r\nCMSIS DSP benchmark vector test succeeded.\r\n");

    while (1)
    {
    }
}

void SysTick_Handler(void)
{
    s_timeMs++;
}

static void TEST_InitTime(void)
{
    s_timeMs = 0;

    /* Configure to 1 ms. */
    SysTick_Config(SystemCoreClock / 1000);
}

static uint32_t TEST_GetTime(void)
{
    return s_timeMs;
}

static void PQ_VectorSqrtQ15Test(void)
{
    uint32_t i;
    uint32_t oldTime;

    q15_t input[VECTOR_INPUT_LEN];
    q15_t result[VECTOR_INPUT_LEN];
    q15_t ref[VECTOR_INPUT_LEN];
    float inputFloat;

    const pq_prescale_t prescale = {
        .inputPrescale  = -15,
        .outputPrescale = 15,
        .outputSaturate = 0,
    };

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        inputFloat = (float)i / (float)VECTOR_INPUT_LEN;
        input[i]   = FLOAT_2_Q15(inputFloat);
        ref[i]     = FLOAT_2_Q15(sqrt(inputFloat));
    }

    PQ_SetCoprocessorScaler(POWERQUAD, &prescale);

    oldTime = TEST_GetTime();
    for (i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorSqrtFixed16(input, result, VECTOR_INPUT_LEN);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(result[i] - ref[i]) <= 10);
    }
}

static void PQ_VectorSinF32Test(void)
{
    uint32_t i;
    uint32_t oldTime;

    float32_t input[VECTOR_INPUT_LEN];
    float32_t result[VECTOR_INPUT_LEN];
    float32_t ref[VECTOR_INPUT_LEN];

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        input[i] = (float)i / (float)VECTOR_INPUT_LEN;
        ref[i]   = sin(input[i]);
    }

    oldTime = TEST_GetTime();
    for (i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorSinF32(input, result, VECTOR_INPUT_LEN);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(result[i] - ref[i]) <= 0.00005);
    }
}

static void PQ_VectorSinQ31Test(void)
{
    uint32_t i;
    uint32_t oldTime;

    q31_t input[VECTOR_INPUT_LEN];
    q31_t result[VECTOR_INPUT_LEN];
    q31_t ref[VECTOR_INPUT_LEN];
    float inputFloat;

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        inputFloat = ((float)i * 2.0f / (float)VECTOR_INPUT_LEN) - 1.0f;
        input[i]   = FLOAT_2_Q31(inputFloat);
        ref[i]     = FLOAT_2_Q31(sin(inputFloat * MATH_PI));
    }

    oldTime = TEST_GetTime();
    for (i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorSinQ31(input, result, VECTOR_INPUT_LEN);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(result[i] - ref[i]) <= 400);
    }
}

static void PQ_VectorSinQ15Test(void)
{
    uint32_t i;
    uint32_t oldTime;

    q15_t input[VECTOR_INPUT_LEN];
    q15_t result[VECTOR_INPUT_LEN];
    q15_t ref[VECTOR_INPUT_LEN];
    float inputFloat;

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        inputFloat = ((float)i * 2.0f / (float)VECTOR_INPUT_LEN) - 1.0f;
        input[i]   = FLOAT_2_Q15(inputFloat);
        ref[i]     = FLOAT_2_Q15(sin(inputFloat * MATH_PI));
    }

    oldTime = TEST_GetTime();
    for (i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorSinQ15(input, result, VECTOR_INPUT_LEN);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(result[i] - ref[i]) <= 2);
    }
}

static void PQ_VectorCosF32Test(void)
{
    uint32_t i;
    uint32_t oldTime;

    float32_t input[VECTOR_INPUT_LEN];
    float32_t result[VECTOR_INPUT_LEN];
    float32_t ref[VECTOR_INPUT_LEN];

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        input[i] = (float)i / (float)VECTOR_INPUT_LEN;
        ref[i]   = cos(input[i]);
    }

    oldTime = TEST_GetTime();
    for (i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorCosF32(input, result, VECTOR_INPUT_LEN);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(result[i] - ref[i]) <= 0.00005);
    }
}

static void PQ_VectorCosQ31Test(void)
{
    uint32_t i;
    uint32_t oldTime;

    q31_t input[VECTOR_INPUT_LEN];
    q31_t result[VECTOR_INPUT_LEN];
    q31_t ref[VECTOR_INPUT_LEN];
    float inputFloat;

    for (i = 0; i < VECTOR_INPUT_LEN; i++)
    {
        inputFloat = ((float)i * 2.0f / (float)VECTOR_INPUT_LEN) - 1.0f;
        input[i]   = FLOAT_2_Q31(inputFloat);
        ref[i]     = FLOAT_2_Q31(cos(inputFloat * MATH_PI));
    }

    oldTime = TEST_GetTime();
    for (i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorCosQ31(input, result, VECTOR_INPUT_LEN);
    }

